Catalogs/ПравилаПоискаДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПоискаДублейНСИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переопределяемое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПравилаПоискаДублейНСИ/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отборы = Новый Структура("ОбъектМетаданных");
	ЗаполнитьЗначенияСвойств(Отборы, Параметры.Отбор);
	Если Отборы.ОбъектМетаданных <> Неопределено Тогда
		Справочник = Отборы.ОбъектМетаданных;
	КонецЕсли;
	ЗаполнитьСписокОтбораСправочников();
	Если Не ПолучитьФункциональнуюОпцию("КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов") Тогда
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Справочники.ПравилаПоискаДублейНСИ.Справочник_Номенклатура_ПоНастройкамУникальностиВидаНоменклатуры);
		МассивСсылок.Добавить(Справочники.ПравилаПоискаДублейНСИ.Справочник_ХарактеристикиНоменклатуры_ПоНастройкамУникальностиВидаНоменклатуры);
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		Отбор.ПравоеЗначение = МассивСсылок;
		Отбор.Использование = Истина
	КонецЕсли;
	РегламентноеЗадание = НайтиРегламентноеЗадание("ПоискДублейНСИ");
	Если РегламентноеЗадание <> Неопределено Тогда
		ПоискДублейИспользование = РегламентноеЗадание.Использование;
		ПоискДублейРасписание    = РегламентноеЗадание.Расписание;
		Если ПоискДублейИспользование Тогда
			Элементы.ПоискДублейРасписание.Заголовок = Строка(РегламентноеЗадание.Расписание);
		КонецЕсли;
	КонецЕсли;
	РегламентноеЗадание = НайтиРегламентноеЗадание("ЗаменаДублейНСИ");
	Если РегламентноеЗадание <> Неопределено Тогда
		ЗаменаДублейИспользование = РегламентноеЗадание.Использование;
		ЗаменаДублейРасписание    = РегламентноеЗадание.Расписание;
		Если ЗаменаДублейИспользование Тогда
			ЗаменаДублейРасписание    = РегламентноеЗадание.Расписание;
		КонецЕсли;
	КонецЕсли;
	ПодсчетМестИспользованияДублей = Константы.ВыполнятьПоискМестИспользованияДублейНСИ.Получить();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписаноПравило" Тогда 
		ЗаполнитьСписокОтбораСправочников();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СправочникПриИзменении(Элемент)
	Отбор = Список.Отбор.Элементы;
	Отбор.Очистить();
	Если ЗначениеЗаполнено(Справочник) Тогда
		НовыйОтбор = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектМетаданных");
		НовыйОтбор.Использование = Истина;
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = Справочник;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СправочникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;  
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СписокОтбора;
	ЭлементОтбора.Использование = Истина;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", ПараметрыФормы,Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДублиПоПравилу(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		ПараметрыОткрытия = Новый Структура("Источник", Элементы.Список.ТекущиеДанные.Ссылка);
		ОткрытьФорму("РегистрСведений.ДублиНСИКПодтверждению.Форма.ФормаСписка", ПараметрыОткрытия);
	ИначеЕсли ВыделенныеСтроки.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать одно правило'"));
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано правило'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиИЗаписатьДубли(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 1 Тогда 
		НайтиИЗаписатьДублиПроверка(Элементы.Список.ТекущиеДанные.Ссылка);
	ИначеЕсли ВыделенныеСтроки.Количество() > 1 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать одно правило'"));
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано правило'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 1 Тогда 
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("Правило", Элементы.Список.ТекущиеДанные.Ссылка);
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		
		ОткрытьФорму("Отчет.ОтчетПоДублямНСИ.ФормаОбъекта", ПараметрыОтчета);
		
	ИначеЕсли ВыделенныеСтроки.Количество() > 1 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отчет строится по одному правилу'"));
	Иначе
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано правило для построения отчета'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокОтбораСправочников()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Правила.ОбъектМетаданных КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаПоискаДублейНСИ КАК Правила
	|ГДЕ
	|	НЕ Правила.ОбъектМетаданных = ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)"; 
	Отбор = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Элементы.Справочник.СписокВыбора.ЗагрузитьЗначения(Отбор);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Отбор, ГруппыИерархии());
	СписокОтбора.ЗагрузитьЗначения(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастроитьРасписаниеПоискДублейНажатие(Элемент)
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ПоискДублейРасписание);
	Диалог.Показать(Новый ОписаниеОповещения("ПоискДублейПослеИзмененияРасписания", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПоискДублейПослеИзмененияРасписания(Расписание, ПараметрыВыполнения) Экспорт
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоискДублейРасписание = Расписание;
	Элементы.ПоискДублейРасписание.Заголовок = Строка(ПоискДублейРасписание);
	ПоискДублейИспользование = Истина;
	ЗаписатьРегламентноеЗадание("ПоискДублейНСИ", ПоискДублейИспользование, 
		ПоискДублейРасписание, "ПоискДублейРасписание");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегламентноеЗадание(ИмяПредопределенного, Использование, Расписание, РеквизитПутьКДанным)
	РегламентноеЗадание = НайтиРегламентноеЗадание(ИмяПредопределенного);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Использование);
	ПараметрыЗадания.Вставить("Расписание", Расписание);
	
	РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, ПараметрыЗадания);
	
	Если РеквизитПутьКДанным <> Неопределено Тогда
		УстановитьДоступность(РеквизитПутьКДанным);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиРегламентноеЗадание(ИмяПредопределенного)
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", ИмяПредопределенного);
	
	РезультатПоиска = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Возврат ?(РезультатПоиска.Количество() = 0, Неопределено, РезультатПоиска[0]);
КонецФункции

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	Если РеквизитПутьКДанным = "ПоискДублейРасписание" Или РеквизитПутьКДанным = "" Тогда
		Если ПоискДублейИспользование Тогда
			РасписаниеПредставление = Строка(ПоискДублейРасписание);
			Представление = ВРег(Лев(РасписаниеПредставление, 1)) + Сред(РасписаниеПредставление, 2);
		Иначе
			Представление = НСтр("ru = 'Настроить расписание'");
		КонецЕсли;
		Элементы.ПоискДублейРасписание.Заголовок = Представление;
	КонецЕсли;
	Если РеквизитПутьКДанным = "ЗаменаДублейРасписание" Или РеквизитПутьКДанным = "" Тогда
		Если ЗаменаДублейИспользование Тогда
			РасписаниеПредставление = Строка(ЗаменаДублейРасписание);
			Представление = ВРег(Лев(РасписаниеПредставление, 1)) + Сред(РасписаниеПредставление, 2);
		Иначе
			Представление = НСтр("ru = 'Настроить расписание'");
		КонецЕсли;
		Элементы.ЗаменаДублейРасписание.Заголовок = Представление;
	КонецЕсли;
	РазделениеВыключено = Не ОбщегоНазначения.РазделениеВключено();
	Элементы.Список.ИзменятьСоставСтрок = РазделениеВыключено
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаДублейРасписаниеНажатие(Элемент)
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЗаменаДублейРасписание);
	Диалог.Показать(Новый ОписаниеОповещения("ЗаменаДублейПослеИзмененияРасписания", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаДублейПослеИзмененияРасписания(Расписание, ПараметрыВыполнения) Экспорт
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменаДублейРасписание = Расписание;
	Элементы.ЗаменаДублейРасписание.Заголовок = Строка(ЗаменаДублейРасписание);
	ЗаменаДублейИспользование = Истина;
	ЗаписатьРегламентноеЗадание("ЗаменаДублейНСИ", ЗаменаДублейИспользование, 
		ЗаменаДублейРасписание, "ЗаменаДублейРасписание");
КонецПроцедуры

&НаКлиенте
Процедура ПоискДублейИспользованиеПриИзменении(Элемент)
	ЗаписатьРегламентноеЗадание("ПоискДублейНСИ", ПоискДублейИспользование, 
		ПоискДублейРасписание, "ПоискДублейРасписание");
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаДублейИспользованиеПриИзменении(Элемент)
	ЗаписатьРегламентноеЗадание("ЗаменаДублейНСИ", ЗаменаДублейИспользование, 
		ЗаменаДублейРасписание, "ЗаменаДублейРасписание");
КонецПроцедуры

&НаКлиенте
Процедура ПодсчетМестИспользованияДублейПриИзменении(Элемент)
	ИзменитьЗначениеКонстанты();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеКонстанты()
	Константы.ВыполнятьПоискМестИспользованияДублейНСИ.Установить(ПодсчетМестИспользованияДублей);
КонецПроцедуры

&НаКлиенте
Процедура ДублиНСИ(Команда)
	ОткрытьФорму("Обработка.ДублиНСИ.Форма.РабочееМесто");
КонецПроцедуры

&НаСервере
Функция ГруппыИерархии()
	Группы = Новый Массив;
	Группы.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Справочники"));
	Группы.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Планы видов характеристик"));
	Возврат Группы;
КонецФункции

&НаКлиенте
Процедура НайтиИЗаписатьДублиПроверка(Правило)
	
	ЕстьДублиПоПравилу = ПроверитьСуществованиеДублей(Правило);
	Если ЕстьДублиПоПравилу Тогда
		ТекстВопроса = НСтр("ru = 'По данному правилу ранее были зарегистрированы дубли. 
					|При повторном поиске все ранее найденные дубли будут удалены. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("НайтиИЗаписатьДублиЗавершение", ЭтотОбъект, Правило),
					ТекстВопроса,
					РежимДиалогаВопрос.ДаНет,
					,,,);
	Иначе
		НайтиИЗаписатьДублиСервер(Правило);
		Оповестить("ОбновитьРабочееМестоУдалениеДублейНСИ");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Дубли найдены и записаны'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиИЗаписатьДублиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		НайтиИЗаписатьДублиСервер(ДополнительныеПараметры);
		Оповестить("ОбновитьРабочееМестоУдалениеДублейНСИ");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Дубли найдены и записаны'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеДублей(Правило)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДублиНСИКПодтверждению.Дубль) КАК КоличествоДублей
	|ИЗ
	|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
	|ГДЕ
	|	ДублиНСИКПодтверждению.Источник = &Правило";
	Запрос.УстановитьПараметр("Правило", Правило);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЕстьДубли = Выборка.КоличествоДублей > 0;
	Иначе
		ЕстьДубли = Ложь;
	КонецЕсли;
	
	Возврат ЕстьДубли;
	
КонецФункции

&НаСервере
Процедура НайтиИЗаписатьДублиСервер(Правило)
	ПоискИЗаменаДублейНСИ.ВыполнитьПоискДублейНСИ(Правило);
КонецПроцедуры

#КонецОбласти
